alibaba/AliOS-Things/platform/mcu/r5f565ne/hal/r_bsp_v3.60/r_bsp/mcu/rx65n/register_access/iodefine.h
typedef struct st_flash {
	union {
		unsigned short WORD;
		struct {
			unsigned short :15;
			unsigned short ROMCEN:1;
		} BIT;
	} ROMCE;
	char           wk0[2];
	union {
		unsigned short WORD;
		struct {
			unsigned short :15;
			unsigned short ROMCIV:1;
		} BIT;
	} ROMCIV;
	char           wk1[45712];
	union {
		unsigned char BYTE;
		struct {
			unsigned char :6;
			unsigned char FLWE:2;
		} BIT;
	} FWEPROR;
	char           wk2[7798185];
	unsigned char  EEPFCLK;
	char           wk3[8143];
	union {
		unsigned char BYTE;
		struct {
			unsigned char CFAE:1;
			unsigned char :2;
			unsigned char CMDLK:1;
			unsigned char DFAE:1;
			unsigned char :3;
		} BIT;
	} FASTAT;
	char           wk4[3];
	union {
		unsigned char BYTE;
		struct {
			unsigned char CFAEIE:1;
			unsigned char :2;
			unsigned char CMDLKIE:1;
			unsigned char DFAEIE:1;
			unsigned char :3;
		} BIT;
	} FAEINT;
	char           wk5[3];
	union {
		unsigned char BYTE;
		struct {
			unsigned char :7;
			unsigned char FRDYIE:1;
		} BIT;
	} FRDYIE;
	char           wk6[23];
	union {
		unsigned long LONG;
		struct {
			unsigned long FSADDR:32;
		} BIT;
	} FSADDR;
	union {
		unsigned long LONG;
		struct {
			unsigned long FEADDR:32;
		} BIT;
	} FEADDR;
	char           wk7[72];
	union {
		unsigned long LONG;
		struct {
			unsigned long :8;
			unsigned long ILGCOMERR:1;
			unsigned long FESETERR:1;
			unsigned long SECERR:1;
			unsigned long OTERR:1;
			unsigned long :4;
			unsigned long FRDY:1;
			unsigned long ILGLERR:1;
			unsigned long ERSERR:1;
			unsigned long PRGERR:1;
			unsigned long SUSRDY:1;
			unsigned long DBFULL:1;
			unsigned long ERSSPD:1;
			unsigned long PRGSPD:1;
			unsigned long :1;
			unsigned long FLWEERR:1;
			unsigned long :6;
		} BIT;
	} FSTATR;
	union {
		unsigned short WORD;
		struct {
			unsigned short KEY:8;
			unsigned short FENTRYD:1;
			unsigned short :6;
			unsigned short FENTRYC:1;
		} BIT;
	} FENTRYR;
	char           wk8[6];
	union {
		unsigned short WORD;
		struct {
			unsigned short KEY:8;
			unsigned short :7;
			unsigned short SUINIT:1;
		} BIT;
	} FSUINITR;
	char           wk9[18];
	union {
		unsigned short WORD;
		struct {
			unsigned short CMDR:8;
			unsigned short PCMDR:8;
		} BIT;
	} FCMDR;
	char           wk10[46];
	union {
		unsigned char BYTE;
		struct {
			unsigned char :7;
			unsigned char BCDIR:1;
		} BIT;
	} FBCCNT;
	char           wk11[3];
	union {
		unsigned char BYTE;
		struct {
			unsigned char :7;
			unsigned char BCST:1;
		} BIT;
	} FBCSTAT;
	char           wk12[3];
	union {
		unsigned long LONG;
		struct {
			unsigned long :13;
			unsigned long PSADR:19;
		} BIT;
	} FPSADDR;
	union {
		unsigned long LONG;
		struct {
			unsigned long BTFLG:1;
			unsigned long :3;
			unsigned long FAWE:12;
			unsigned long FSPR:1;
			unsigned long :3;
			unsigned long FAWS:12;
		} BIT;
	} FAWMON;
	union {
		unsigned short WORD;
		struct {
			unsigned short :15;
			unsigned short ESUSPMD:1;
		} BIT;
	} FCPSR;
	char           wk13[2];
	union {
		unsigned short WORD;
		struct {
			unsigned short KEY:8;
			unsigned short PCKA:8;
		} BIT;
	} FPCKAR;
	char           wk14[2];
	union {
		unsigned short WORD;
		struct {
			unsigned short KEY:8;
			unsigned short :6;
			unsigned short SAS:2;
		} BIT;
	} FSUACR;
} st_flash_t;

typedef struct st_glcdc {
	union {
		unsigned long LONG;
		struct {
			unsigned long A:8;
			unsigned long R:8;
			unsigned long G:8;
			unsigned long B:8;
		} BIT;
	} GR1CLUT0[256];
	union {
		unsigned long LONG;
		struct {
			unsigned long A:8;
			unsigned long R:8;
			unsigned long G:8;
			unsigned long B:8;
		} BIT;
	} GR1CLUT1[256];
	union {
		unsigned long LONG;
		struct {
			unsigned long A:8;
			unsigned long R:8;
			unsigned long G:8;
			unsigned long B:8;
		} BIT;
	} GR2CLUT0[256];
	union {
		unsigned long LONG;
		struct {
			unsigned long A:8;
			unsigned long R:8;
			unsigned long G:8;
			unsigned long B:8;
		} BIT;
	} GR2CLUT1[256];
	union {
		unsigned long LONG;
		struct {
			unsigned long :15;
			unsigned long SWRST:1;
			unsigned long :7;
			unsigned long VEN:1;
			unsigned long :7;
			unsigned long EN:1;
		} BIT;
	} BGEN;
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long FV:11;
			unsigned long :5;
			unsigned long FH:11;
		} BIT;
	} BGPERI;
	union {
		unsigned long LONG;
		struct {
			unsigned long :12;
			unsigned long VP:4;
			unsigned long :12;
			unsigned long HP:4;
		} BIT;
	} BGSYNC;
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long VP:11;
			unsigned long :5;
			unsigned long VW:11;
		} BIT;
	} BGVSIZE;
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long HP:11;
			unsigned long :5;
			unsigned long HW:11;
		} BIT;
	} BGHSIZE;
	union {
		unsigned long LONG;
		struct {
			unsigned long :8;
			unsigned long R:8;
			unsigned long G:8;
			unsigned long B:8;
		} BIT;
	} BGCOLOR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :15;
			unsigned long SWRST:1;
			unsigned long :7;
			unsigned long VEN:1;
			unsigned long :7;
			unsigned long EN:1;
		} BIT;
	} BGMON;
	char           wk0[228];
	union {
		unsigned long LONG;
		struct {
			unsigned long :31;
			unsigned long VEN:1;
		} BIT;
	} GR1VEN;
	union {
		unsigned long LONG;
		struct {
			unsigned long :31;
			unsigned long RENB:1;
		} BIT;
	} GR1FLMRD;
	char           wk1[4];
	unsigned long  GR1FLM2;
	union {
		unsigned long LONG;
		struct {
			unsigned long LNOFF:16;
			unsigned long :16;
		} BIT;
	} GR1FLM3;
	char           wk2[4];
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long LNNUM:11;
			unsigned long DATANUM:16;
		} BIT;
	} GR1FLM5;
	union {
		unsigned long LONG;
		struct {
			unsigned long :1;
			unsigned long FORMAT:3;
			unsigned long :28;
		} BIT;
	} GR1FLM6;
	union {
		unsigned long LONG;
		struct {
			unsigned long :19;
			unsigned long ARCON:1;
			unsigned long :3;
			unsigned long ARCDISPON:1;
			unsigned long :3;
			unsigned long GRCDISPON:1;
			unsigned long :2;
			unsigned long DISPSEL:2;
		} BIT;
	} GR1AB1;
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long GRCVS:11;
			unsigned long :5;
			unsigned long GRCVW:11;
		} BIT;
	} GR1AB2;
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long GRCHS:11;
			unsigned long :5;
			unsigned long GRCHW:11;
		} BIT;
	} GR1AB3;
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long ARCVS:11;
			unsigned long :5;
			unsigned long ARCVW:11;
		} BIT;
	} GR1AB4;
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long ARCHS:11;
			unsigned long :5;
			unsigned long ARCHW:11;
		} BIT;
	} GR1AB5;
	union {
		unsigned long LONG;
		struct {
			unsigned long :7;
			unsigned long ARCCOEF:9;
			unsigned long :8;
			unsigned long ARCRATE:8;
		} BIT;
	} GR1AB6;
	union {
		unsigned long LONG;
		struct {
			unsigned long :8;
			unsigned long ARCDEF:8;
			unsigned long :15;
			unsigned long CKON:1;
		} BIT;
	} GR1AB7;
	union {
		unsigned long LONG;
		struct {
			unsigned long :8;
			unsigned long CKKG:8;
			unsigned long CKKB:8;
			unsigned long CKKR:8;
		} BIT;
	} GR1AB8;
	union {
		unsigned long LONG;
		struct {
			unsigned long CKA:8;
			unsigned long CKG:8;
			unsigned long CKB:8;
			unsigned long CKR:8;
		} BIT;
	} GR1AB9;
	char           wk3[8];
	union {
		unsigned long LONG;
		struct {
			unsigned long :8;
			unsigned long G:8;
			unsigned long B:8;
			unsigned long R:8;
		} BIT;
	} GR1BASE;
	union {
		unsigned long LONG;
		struct {
			unsigned long :15;
			unsigned long SEL:1;
			unsigned long :5;
			unsigned long LINE:11;
		} BIT;
	} GR1CLUTINT;
	union {
		unsigned long LONG;
		struct {
			unsigned long :15;
			unsigned long UFST:1;
			unsigned long :15;
			unsigned long ARCST:1;
		} BIT;
	} GR1MON;
	char           wk4[168];
	union {
		unsigned long LONG;
		struct {
			unsigned long :31;
			unsigned long VEN:1;
		} BIT;
	} GR2VEN;
	union {
		unsigned long LONG;
		struct {
			unsigned long :31;
			unsigned long RENB:1;
		} BIT;
	} GR2FLMRD;
	char           wk5[4];
	unsigned long  GR2FLM2;
	union {
		unsigned long LONG;
		struct {
			unsigned long LNOFF:16;
			unsigned long :16;
		} BIT;
	} GR2FLM3;
	char           wk6[4];
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long LNNUM:11;
			unsigned long DATANUM:16;
		} BIT;
	} GR2FLM5;
	union {
		unsigned long LONG;
		struct {
			unsigned long :1;
			unsigned long FORMAT:3;
			unsigned long :28;
		} BIT;
	} GR2FLM6;
	union {
		unsigned long LONG;
		struct {
			unsigned long :19;
			unsigned long ARCON:1;
			unsigned long :3;
			unsigned long ARCDISPON:1;
			unsigned long :3;
			unsigned long GRCDISPON:1;
			unsigned long :2;
			unsigned long DISPSEL:2;
		} BIT;
	} GR2AB1;
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long GRCVS:11;
			unsigned long :5;
			unsigned long GRCVW:11;
		} BIT;
	} GR2AB2;
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long GRCHS:11;
			unsigned long :5;
			unsigned long GRCHW:11;
		} BIT;
	} GR2AB3;
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long ARCVS:11;
			unsigned long :5;
			unsigned long ARCVW:11;
		} BIT;
	} GR2AB4;
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long ARCHS:11;
			unsigned long :5;
			unsigned long ARCHW:11;
		} BIT;
	} GR2AB5;
	union {
		unsigned long LONG;
		struct {
			unsigned long :7;
			unsigned long ARCCOEF:9;
			unsigned long :8;
			unsigned long ARCRATE:8;
		} BIT;
	} GR2AB6;
	union {
		unsigned long LONG;
		struct {
			unsigned long :8;
			unsigned long ARCDEF:8;
			unsigned long :15;
			unsigned long CKON:1;
		} BIT;
	} GR2AB7;
	union {
		unsigned long LONG;
		struct {
			unsigned long :8;
			unsigned long CKKG:8;
			unsigned long CKKB:8;
			unsigned long CKKR:8;
		} BIT;
	} GR2AB8;
	union {
		unsigned long LONG;
		struct {
			unsigned long CKA:8;
			unsigned long CKG:8;
			unsigned long CKB:8;
			unsigned long CKR:8;
		} BIT;
	} GR2AB9;
	char           wk7[8];
	union {
		unsigned long LONG;
		struct {
			unsigned long :8;
			unsigned long G:8;
			unsigned long B:8;
			unsigned long R:8;
		} BIT;
	} GR2BASE;
	union {
		unsigned long LONG;
		struct {
			unsigned long :15;
			unsigned long SEL:1;
			unsigned long :5;
			unsigned long LINE:11;
		} BIT;
	} GR2CLUTINT;
	union {
		unsigned long LONG;
		struct {
			unsigned long :15;
			unsigned long UFST:1;
			unsigned long :15;
			unsigned long ARCST:1;
		} BIT;
	} GR2MON;
	char           wk8[168];
	union {
		unsigned long LONG;
		struct {
			unsigned long :31;
			unsigned long VEN:1;
		} BIT;
	} GAMGVEN;
	union {
		unsigned long LONG;
		struct {
			unsigned long :31;
			unsigned long GAMON:1;
		} BIT;
	} GAMSW;
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long GAIN00:11;
			unsigned long :5;
			unsigned long GAIN01:11;
		} BIT;
	} GAMGLUT1;
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long GAIN02:11;
			unsigned long :5;
			unsigned long GAIN03:11;
		} BIT;
	} GAMGLUT2;
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long GAIN04:11;
			unsigned long :5;
			unsigned long GAIN05:11;
		} BIT;
	} GAMGLUT3;
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long GAIN06:11;
			unsigned long :5;
			unsigned long GAIN07:11;
		} BIT;
	} GAMGLUT4;
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long GAIN08:11;
			unsigned long :5;
			unsigned long GAIN09:11;
		} BIT;
	} GAMGLUT5;
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long GAIN10:11;
			unsigned long :5;
			unsigned long GAIN11:11;
		} BIT;
	} GAMGLUT6;
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long GAIN12:11;
			unsigned long :5;
			unsigned long GAIN13:11;
		} BIT;
	} GAMGLUT7;
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long GAIN14:11;
			unsigned long :5;
			unsigned long GAIN15:11;
		} BIT;
	} GAMGLUT8;
	union {
		unsigned long LONG;
		struct {
			unsigned long :2;
			unsigned long TH01:10;
			unsigned long TH02:10;
			unsigned long TH03:10;
		} BIT;
	} GAMGAREA1;
	union {
		unsigned long LONG;
		struct {
			unsigned long :2;
			unsigned long TH04:10;
			unsigned long TH05:10;
			unsigned long TH06:10;
		} BIT;
	} GAMGAREA2;
	union {
		unsigned long LONG;
		struct {
			unsigned long :2;
			unsigned long TH07:10;
			unsigned long TH08:10;
			unsigned long TH09:10;
		} BIT;
	} GAMGAREA3;
	union {
		unsigned long LONG;
		struct {
			unsigned long :2;
			unsigned long TH10:10;
			unsigned long TH11:10;
			unsigned long TH12:10;
		} BIT;
	} GAMGAREA4;
	union {
		unsigned long LONG;
		struct {
			unsigned long :2;
			unsigned long TH13:10;
			unsigned long TH14:10;
			unsigned long TH15:10;
		} BIT;
	} GAMGAREA5;
	char           wk9[4];
	union {
		unsigned long LONG;
		struct {
			unsigned long :31;
			unsigned long VEN:1;
		} BIT;
	} GAMBVEN;
	char           wk10[4];
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long GAIN00:11;
			unsigned long :5;
			unsigned long GAIN01:11;
		} BIT;
	} GAMBLUT1;
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long GAIN02:11;
			unsigned long :5;
			unsigned long GAIN03:11;
		} BIT;
	} GAMBLUT2;
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long GAIN04:11;
			unsigned long :5;
			unsigned long GAIN05:11;
		} BIT;
	} GAMBLUT3;
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long GAIN06:11;
			unsigned long :5;
			unsigned long GAIN07:11;
		} BIT;
	} GAMBLUT4;
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long GAIN08:11;
			unsigned long :5;
			unsigned long GAIN09:11;
		} BIT;
	} GAMBLUT5;
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long GAIN10:11;
			unsigned long :5;
			unsigned long GAIN11:11;
		} BIT;
	} GAMBLUT6;
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long GAIN12:11;
			unsigned long :5;
			unsigned long GAIN13:11;
		} BIT;
	} GAMBLUT7;
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long GAIN14:11;
			unsigned long :5;
			unsigned long GAIN15:11;
		} BIT;
	} GAMBLUT8;
	union {
		unsigned long LONG;
		struct {
			unsigned long :2;
			unsigned long TH01:10;
			unsigned long TH02:10;
			unsigned long TH03:10;
		} BIT;
	} GAMBAREA1;
	union {
		unsigned long LONG;
		struct {
			unsigned long :2;
			unsigned long TH04:10;
			unsigned long TH05:10;
			unsigned long TH06:10;
		} BIT;
	} GAMBAREA2;
	union {
		unsigned long LONG;
		struct {
			unsigned long :2;
			unsigned long TH07:10;
			unsigned long TH08:10;
			unsigned long TH09:10;
		} BIT;
	} GAMBAREA3;
	union {
		unsigned long LONG;
		struct {
			unsigned long :2;
			unsigned long TH10:10;
			unsigned long TH11:10;
			unsigned long TH12:10;
		} BIT;
	} GAMBAREA4;
	union {
		unsigned long LONG;
		struct {
			unsigned long :2;
			unsigned long TH13:10;
			unsigned long TH14:10;
			unsigned long TH15:10;
		} BIT;
	} GAMBAREA5;
	char           wk11[4];
	union {
		unsigned long LONG;
		struct {
			unsigned long :31;
			unsigned long VEN:1;
		} BIT;
	} GAMRVEN;
	char           wk12[4];
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long GAIN00:11;
			unsigned long :5;
			unsigned long GAIN01:11;
		} BIT;
	} GAMRLUT1;
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long GAIN02:11;
			unsigned long :5;
			unsigned long GAIN03:11;
		} BIT;
	} GAMRLUT2;
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long GAIN04:11;
			unsigned long :5;
			unsigned long GAIN05:11;
		} BIT;
	} GAMRLUT3;
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long GAIN06:11;
			unsigned long :5;
			unsigned long GAIN07:11;
		} BIT;
	} GAMRLUT4;
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long GAIN08:11;
			unsigned long :5;
			unsigned long GAIN09:11;
		} BIT;
	} GAMRLUT5;
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long GAIN10:11;
			unsigned long :5;
			unsigned long GAIN11:11;
		} BIT;
	} GAMRLUT6;
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long GAIN12:11;
			unsigned long :5;
			unsigned long GAIN13:11;
		} BIT;
	} GAMRLUT7;
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long GAIN14:11;
			unsigned long :5;
			unsigned long GAIN15:11;
		} BIT;
	} GAMRLUT8;
	union {
		unsigned long LONG;
		struct {
			unsigned long :2;
			unsigned long TH01:10;
			unsigned long TH02:10;
			unsigned long TH03:10;
		} BIT;
	} GAMRAREA1;
	union {
		unsigned long LONG;
		struct {
			unsigned long :2;
			unsigned long TH04:10;
			unsigned long TH05:10;
			unsigned long TH06:10;
		} BIT;
	} GAMRAREA2;
	union {
		unsigned long LONG;
		struct {
			unsigned long :2;
			unsigned long TH07:10;
			unsigned long TH08:10;
			unsigned long TH09:10;
		} BIT;
	} GAMRAREA3;
	union {
		unsigned long LONG;
		struct {
			unsigned long :2;
			unsigned long TH10:10;
			unsigned long TH11:10;
			unsigned long TH12:10;
		} BIT;
	} GAMRAREA4;
	union {
		unsigned long LONG;
		struct {
			unsigned long :2;
			unsigned long TH13:10;
			unsigned long TH14:10;
			unsigned long TH15:10;
		} BIT;
	} GAMRAREA5;
	char           wk13[4];
	union {
		unsigned long LONG;
		struct {
			unsigned long :31;
			unsigned long VEN:1;
		} BIT;
	} OUTVEN;
	union {
		unsigned long LONG;
		struct {
			unsigned long :3;
			unsigned long ENDIANON:1;
			unsigned long :3;
			unsigned long SWAPON:1;
			unsigned long :10;
			unsigned long FORMAT:2;
			unsigned long :2;
			unsigned long FRQSEL:1;
			unsigned long :4;
			unsigned long DIRSEL:1;
			unsigned long :2;
			unsigned long PHASE:2;
		} BIT;
	} OUTSET;
	union {
		unsigned long LONG;
		struct {
			unsigned long :22;
			unsigned long BRTG:10;
		} BIT;
	} BRIGHT1;
	union {
		unsigned long LONG;
		struct {
			unsigned long :6;
			unsigned long BRTB:10;
			unsigned long :6;
			unsigned long BRTR:10;
		} BIT;
	} BRIGHT2;
	union {
		unsigned long LONG;
		struct {
			unsigned long :8;
			unsigned long CONTG:8;
			unsigned long CONTB:8;
			unsigned long CONTR:8;
		} BIT;
	} CONTRAST;
	union {
		unsigned long LONG;
		struct {
			unsigned long :10;
			unsigned long SEL:2;
			unsigned long :2;
			unsigned long FORM:2;
			unsigned long :2;
			unsigned long PA:2;
			unsigned long :2;
			unsigned long PB:2;
			unsigned long :2;
			unsigned long PC:2;
			unsigned long :2;
			unsigned long PD:2;
		} BIT;
	} PANELDTHA;
	char           wk14[12];
	union {
		unsigned long LONG;
		struct {
			unsigned long :19;
			unsigned long FRONTGAM:1;
			unsigned long :3;
			unsigned long LCDEDG:1;
			unsigned long :1;
			unsigned long TCON0EDG:1;
			unsigned long TCON1EDG:1;
			unsigned long TCON2EDG:1;
			unsigned long TCON3EDG:1;
			unsigned long :3;
		} BIT;
	} CLKPHASE;
	char           wk15[28];
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long HALF:11;
			unsigned long :5;
			unsigned long OFFSET:11;
		} BIT;
	} TCONTIM;
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long VS:11;
			unsigned long :5;
			unsigned long VW:11;
		} BIT;
	} TCONSTVA1;
	union {
		unsigned long LONG;
		struct {
			unsigned long :27;
			unsigned long INV:1;
			unsigned long :1;
			unsigned long SEL:3;
		} BIT;
	} TCONSTVA2;
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long VS:11;
			unsigned long :5;
			unsigned long VW:11;
		} BIT;
	} TCONSTVB1;
	union {
		unsigned long LONG;
		struct {
			unsigned long :27;
			unsigned long INV:1;
			unsigned long :1;
			unsigned long SEL:3;
		} BIT;
	} TCONSTVB2;
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long HS:11;
			unsigned long :5;
			unsigned long HW:11;
		} BIT;
	} TCONSTHA1;
	union {
		unsigned long LONG;
		struct {
			unsigned long :23;
			unsigned long HSSEL:1;
			unsigned long :3;
			unsigned long INV:1;
			unsigned long :1;
			unsigned long SEL:3;
		} BIT;
	} TCONSTHA2;
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long HS:11;
			unsigned long :5;
			unsigned long HW:11;
		} BIT;
	} TCONSTHB1;
	union {
		unsigned long LONG;
		struct {
			unsigned long :23;
			unsigned long HSSEL:1;
			unsigned long :3;
			unsigned long INV:1;
			unsigned long :1;
			unsigned long SEL:3;
		} BIT;
	} TCONSTHB2;
	union {
		unsigned long LONG;
		struct {
			unsigned long :31;
			unsigned long INV:1;
		} BIT;
	} TCONDE;
	char           wk16[20];
	union {
		unsigned long LONG;
		struct {
			unsigned long :29;
			unsigned long GR2UFDTC:1;
			unsigned long GR1UFDTC:1;
			unsigned long VPOSDTC:1;
		} BIT;
	} DTCTEN;
	union {
		unsigned long LONG;
		struct {
			unsigned long :29;
			unsigned long GR2UFINTEN:1;
			unsigned long GR1UFINTEN:1;
			unsigned long VPOSINTEN:1;
		} BIT;
	} INTEN;
	union {
		unsigned long LONG;
		struct {
			unsigned long :29;
			unsigned long GR2UFCLR:1;
			unsigned long GR1UFCLR:1;
			unsigned long VPOSCLR:1;
		} BIT;
	} STCLR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :29;
			unsigned long GR2UF:1;
			unsigned long GR1UF:1;
			unsigned long VPOS:1;
		} BIT;
	} STMON;
	union {
		unsigned long LONG;
		struct {
			unsigned long :19;
			unsigned long PIXSEL:1;
			unsigned long :3;
			unsigned long CLKSEL:1;
			unsigned long :1;
			unsigned long CLKEN:1;
			unsigned long DCDR:6;
		} BIT;
	} PANELCLK;
} st_glcdc_t;

